/*  drivers/input/keyboard/synaptics_i2c_rmi.c *  * Copyright  (C) 2007  Google,
Inc. * * This software is licensed  under the terms of the GNU General  Public *
License version 2, as  published by the Free  Software Foundation, and *  may be
copied,  distributed,  and modified  under  those terms.  *  * This  program  is
distributed in  the hope  that it  will be  useful, *  but WITHOUT ANY WARRANTY;
without  even  the  implied  warranty of  *  MERCHANTABILITY  or  FITNESS FOR  A
PARTICULAR PURPOSE.  See the * GNU General Public License for more details. * */

#include <linux/module.h>
#include <linux/delay.h>
#include <linux/earlysuspend.h>
#include <linux/hrtimer.h>
#include <linux/i2c.h>
#include <linux/input.h>
#include <linux/interrupt.h>
#include <linux/io.h>
#include <linux/slab.h>
#include <linux/platform_device.h>
#include <linux/synaptics_i2c_rmi.h>
#include <mach/gpio.h>

#include "synaptics_ts_firmware_rev_c.h"

#define SYNAPTICS_TOUCH_DEBUG 1
 #if SYNAPTICS_TOUCH_DEBUG
 #define DEBUG_MSG(args...)  printk(args)
 #else
 #define DEBUG_MSG(args...)
 #endif

#define LGHDK_PENDING_TOUCHKEY 		// for preventing wrong touchkey reporting 
#define LGHDK_TOUCH_SET_THRESHOLD   // for preventing jitter during holding
#define LGHDK_TOGGLE_MELT_MODE	    // for helding melt mode ( melt mode for preventing ghost finger)
#define LGHDK_TOUCHKEY_RANGE_TRIM	// for triming touch event out of touchkey range
#define LGHDK_MORE_THREE_FINGER_SPPORT	
#define LGHDK_SYNAPTICS_SUPPORT_FW_UPGRADE
#define LGHDK_TOUCH_GRIP_SUPPRESSION
#define LGHDK_TOUCH_HAND_SUPPRESSION
#define LGHDK_LONGPRESS_TOUCH_DURING_BOOTING
#define LGHDK_USED_RESET_PIN_IN_SUSPEND

#define SYNAPTICS_INT_REG		0x50
#define SYNAPTICS_INT_FLASH		1<<0
#define SYNAPTICS_INT_STATUS 	1<<1
#define SYNAPTICS_INT_ABS0 		1<<2
#define SYNAPTICS_INT_BUTTON	1<<3

#define SYNAPTICS_RMI_QUERY_BASE_REG			0xE3
#define SYNAPTICS_RMI_CMD_BASE_REG				0xE4
#define SYNAPTICS_FLASH_QUERY_BASE_REG			0xE9
#define SYNAPTICS_FLASH_DATA_BASE_REG			0xEC

#define SYNAPTICS_CONTROL_REG		0x4F
#define SYNAPTICS_X_THRESH_REG	0x53
#define SYNAPTICS_Y_THRESH_REG	0x54
#define SYNAPTICS_RESET_REG		0xA4
#define SYNAPTICS_FW_REG	0xAB 

#define SYNAPTICS_FAMILY			0xb1
#define SYNAPTICS_REVISION			0xb2

#define SYNAPTICS_CONTROL_SLEEP 	1<<0
#define SYNAPTICS_CONTROL_NOSLEEP	1<<2
#define SYNAPTICS_INT_ABS0 		1<<2
#define SYNAPTICS_XY_THRESH	0x03

#ifdef LGHDK_SYNAPTICS_SUPPORT_FW_UPGRADE
#define SYNAPTICS_FLASH_CMD_FW_CRC				0x01
#define SYNAPTICS_FLASH_CMD_FW_WRITE			0x02
#define SYNAPTICS_FLASH_CMD_ERASEALL			0x03
#define SYNAPTICS_FLASH_CMD_CONFIG_READ			0x05
#define SYNAPTICS_FLASH_CMD_CONFIG_WRITE		0x06
#define SYNAPTICS_FLASH_CMD_CONFIG_ERASE		0x07
#define SYNAPTICS_FLASH_CMD_ENABLE				0x0F
#define SYNAPTICS_FLASH_NORMAL_RESULT			0x80

#define	SYNAPTICS_TOUCH_MULTI_PANEL_SUPPORT		0
#if SYNAPTICS_TOUCH_MULTI_PANEL_SUPPORT
	#define FW_IMAGE_SIZE 	28929
	unsigned char SynapticsFirmware[FW_IMAGE_SIZE];
#endif

#define TOUCH_INT_N_GPIO						52        //Reference kernel\arch\arm\march-omap2\Board-Cosmopolitan.c

#endif //LGHDK_SYNAPTICS_SUPPORT_FW_UPGRADE

static struct workqueue_struct *synaptics_wq;

struct synaptics_ts_data {
	uint16_t addr;
	struct i2c_client *client;
	struct input_dev *input_dev;
	int use_irq;
	bool has_relative_report;
	struct hrtimer timer;
	struct work_struct  work;
	struct delayed_work init_delayed_work;
#ifdef LGHDK_LONGPRESS_TOUCH_DURING_BOOTING	
	struct delayed_work init_delayed_no_melt_work;
#endif
	struct delayed_work touchkey_delayed_work;
#ifdef LGHDK_USED_RESET_PIN_IN_SUSPEND
	struct delayed_work reset_delayed_work;
#endif
	uint32_t flags;
	int (*power)(int on);
	int x_lastpt;
	int y_lastpt;
	struct early_suspend early_suspend;
	uint32_t	button_state;
#ifdef LGHDK_PENDING_TOUCHKEY
	int				pending_touchkey;
	struct timespec	pending_delay_time;
#endif
#ifdef LGHDK_TOGGLE_MELT_MODE
	int				melt_toggle_state;
	struct timespec short_touch_delay_time;
#endif
#ifdef LGHDK_TOUCH_SET_THRESHOLD
	int				count_for_enter_reducemode;
	int				x_pos_for_toggle_reportmode;
	int				y_pos_for_toggle_reportmode;
	int				report_mode;
#endif

};

#ifdef CONFIG_HAS_EARLYSUSPEND
static void synaptics_ts_early_suspend(struct early_suspend *h);
static void synaptics_ts_late_resume(struct early_suspend *h);
#endif

/*===========================================================================
                DEFINITIONS AND DECLARATIONS FOR MODULE

This section contains definitions for constants, macros, types, variables
and other items needed by this module.
===========================================================================*/

/*                               Macros                                    */
// 0x00 - not present, 0x01 - present & accurate, 0x10 - present but not accurate, 0x11 - Reserved
#define TS_SNTS_GET_X_POSITION(high_reg, low_reg) \
		((int)(high_reg*0x10) + (int)(low_reg&0x0F))
#define TS_SNTS_GET_Y_POSITION(high_reg, low_reg) \
		((int)(high_reg*0x10) + (int)((low_reg&0xF0)/0x10))

#define FINGER_MAX 10 
#define TS_W  1123
#define TS_H  1872

#ifdef LGHDK_PENDING_TOUCHKEY
#define LGHDK_PENDING_TIME	    	175 * NSEC_PER_MSEC // 300ms

#define LGHDK_PENDING_IDLE_STATE				-1
#define LGHDK_PENDING_HANDLED					-2
#define LGHDK_PENDING_SECOND_TOUCH_DETECTED		-3
#endif

#ifdef LGHDK_TOGGLE_MELT_MODE
#define LGHDK_MELT_IN_MELTMODE			0
#define LGHDK_MELT_TRY_ENTER_NOMELT		1
#define LGHDK_MELT_BLOCK_ENTER_NOMELT	2
#define LGHDK_MELT_IN_NOMELTMODE		3

#define LGHDK_MELT_SYNAPTICS_MELT_VALUE		0x01
#define LGHDK_MELT_SYNAPTICS_NOMELT_VALUE	0x00

#define LGHDK_MELT_SHORT_TAP_MAX_TIME	2 // 2sec
#endif


#ifdef LGHDK_TOUCH_SET_THRESHOLD
#define LGHDK_SYNAPTICS_REG_REPORT_MODE	0x51
#define LGHDK_SYNAPTICS_REG_DELTA_X_THRESH	0x53
#define LGHDK_SYNAPTICS_REG_DELTA_Y_THRESH	0x54

#define LGHDK_SYNAPTICS_VAL_NORMAL_REPORT_MODE	0x00
#define LGHDK_SYNAPTICS_VAL_REDUCE_REPORT_MODE	0x01
#define LGHDK_SYNAPTICS_VAL_ABS_POS_FILTER		0x08


//#define LGHDK_SYNAPTICS_VAL_THRESHOLD		0x20
#define LGHDK_SYNAPTICS_VAL_THRESHOLD		0x02


#define	LGHDK_SYNAPTICS_ENTER_HOLD_COUNT	10


#define	LGHDK_SYNAPTICS_JITTER_DIRECTION_UP	1
#define	LGHDK_SYNAPTICS_JITTER_DIRECTION_DOWN	2
#define	LGHDK_SYNAPTICS_JITTER_DIRECTION_LEFT	3
#define	LGHDK_SYNAPTICS_JITTER_DIRECTION_RIGHT	4
#define	LGHDK_SYNAPTICS_JITTER_DIRECTION_CENTER	5

#endif

#define	LGHDK_SYNAPTICS_REG_FINGER_STATUS0 0x15
#define	LGHDK_SYNAPTICS_REG_FINGER_STATUS1 0x16
#define	LGHDK_SYNAPTICS_REG_FINGER_STATUS2 0x17

#define LGHDK_COUNT_PER_FINGER_STATUS		4

#define LGHDK_SYNAPTICS_REG_FINGER_DATA_START_ADDR		0x18
#define LGHDK_SYNAPTICS_REG_FINGER_DATA_GAP				0x05

#define LGHDK_SYNAPTICS_REG_FINGER_VALID_DATA_SIZE		5


#define SYNAPTICS_FLASH_CONTROL_REG				0x12
#define SYNAPTICS_DATA_BASE_REG					0x13
#define SYNAPTICS_INT_STATUS_REG				0x14
#define GESTURE_FLAGS	0x4A


typedef struct
{
	unsigned char device_status_reg;            //0x13
	unsigned char interrupt_status_reg;			//0x14
	unsigned char finger_state_reg[3];			//0x15~0x17
	// Finger 0
	unsigned char X_high_position_finger0_reg;  //0x18
	unsigned char Y_high_position_finger0_reg;	//0x19
	unsigned char XY_low_position_finger0_reg;	//0x1A
	unsigned char XY_width_finger0_reg;			//0x1B
	unsigned char Z_finger0_reg;				//0x1C
	// Finger 1
	unsigned char X_high_position_finger1_reg;  //0x1D
	unsigned char Y_high_position_finger1_reg;	//0x1E
	unsigned char XY_low_position_finger1_reg;	//0x1F
	unsigned char XY_width_finger1_reg;			//0x20
	unsigned char Z_finger1_reg;				//0x21
} ts_sensor_data;

typedef struct {
	unsigned char finger_count;
	int X_position[FINGER_MAX];
	int Y_position[FINGER_MAX];
	int width[FINGER_MAX];
	int pressure[FINGER_MAX];
} ts_finger_data;

static ts_sensor_data ts_reg_data={0};
static ts_finger_data curr_ts_data;

#ifdef LGHDK_TOUCH_GRIP_SUPPRESSION
static int g_gripIgnoreRangeValue = 0;
static int g_receivedPixelValue = 0;
#endif

#ifdef LGHDK_TOUCH_HAND_SUPPRESSION
static int g_handIgnoreValue = 0;
#endif

unsigned char  touch_fw_version = 0;

#if defined(CONFIG_MACH_LGE_COSMO_DOMASTIC)
#define LGHDK_VALID_TOUCHKEY_COUNT	3
// Darren.kang move for global usage
static unsigned int button_map[LGHDK_VALID_TOUCHKEY_COUNT + 1] = {KEY_MENU, KEY_HOME, KEY_BACK, KEY_UNKNOWN};
#else

#define LGHDK_VALID_TOUCHKEY_COUNT	4
// Darren.kang move for global usage
static unsigned int button_map[LGHDK_VALID_TOUCHKEY_COUNT + 1] = {KEY_MENU, KEY_HOME, KEY_BACK, KEY_SEARCH, KEY_UNKNOWN};
#endif




