/*  drivers/input/keyboard/synaptics_i2c_rmi.c *  * Copyright  (C) 2007  Google,
Inc. * * This software is licensed  under the terms of the GNU General  Public *
License version 2, as  published by the Free  Software Foundation, and *  may be
copied,  distributed,  and modified  under  those terms.  *  * This  program  is
distributed in  the hope  that it  will be  useful, *  but WITHOUT ANY WARRANTY;
without  even  the  implied  warranty of  *  MERCHANTABILITY  or  FITNESS FOR  A
PARTICULAR PURPOSE.  See the * GNU General Public License for more details. * */

#include <linux/module.h>
#include <linux/delay.h>
#include <linux/earlysuspend.h>
#include <linux/hrtimer.h>
#include <linux/i2c.h>
#include <linux/input.h>
#include <linux/interrupt.h>
#include <linux/io.h>
#include <linux/platform_device.h>
#include <linux/synaptics_i2c_rmi.h>
#include <mach/gpio.h>
#include <linux/slab.h>

//#include <linux/i2c/twl6030.h>

#define SYNAPTICS_TOUCH_DEBUG 1
 #if SYNAPTICS_TOUCH_DEBUG
 #define DEBUG_MSG(args...)  printk(args)
 #else
 #define DEBUG_MSG(args...)
 #endif
 
#define HEAVEN_TS_EN_GPIO 		52
#define HEAVEN_TS_POLLING_TIME 	15 /* polling time(msec) when touch was pressed */ 
#define SYNAPTICS_INT_REG		0x50
#define SYNAPTICS_INT_FLASH		1<<0
#define SYNAPTICS_INT_STATUS 	1<<1
#define SYNAPTICS_INT_ABS0 		1<<2
#define SYNAPTICS_INT_BUTTON	1<<3

#if 0
#define SYNAPTICS_CONTROL_REG		0x4F
#else	/* JamesLee :: for 4.3inch touch */
#define SYNAPTICS_CONTROL_REG		0x21
#endif
#define SYNAPTICS_CONTROL_SLEEP 	1<<0
#define SYNAPTICS_CONTROL_NOSLEEP	1<<2


static struct workqueue_struct *synaptics_wq;

struct synaptics_ts_data {
	uint16_t addr;
	struct i2c_client *client;
	struct input_dev *input_dev;
	int use_irq;
	bool has_relative_report;
	struct hrtimer timer;
	struct work_struct  work;
	uint16_t max[2];
	int snap_state[2][2];
	int snap_down_on[2];
	int snap_down_off[2];
	int snap_up_on[2];
	int snap_up_off[2];
	int snap_down[2];
	int snap_up[2];
	uint32_t flags;
	int reported_finger_count;
	int8_t sensitivity_adjust;
	int (*power)(int on);
// 20100504 jh.koo@lge.com, correction of finger space [START_LGE]
	unsigned int count;
	int x_lastpt;
	int y_lastpt;
// 20100504 jh.koo@lge.com, correction of finger space [END_LGE]	
	struct early_suspend early_suspend;
	uint32_t	button_state;

};

#ifdef CONFIG_HAS_EARLYSUSPEND
static void synaptics_ts_early_suspend(struct early_suspend *h);
static void synaptics_ts_late_resume(struct early_suspend *h);
#endif

/*===========================================================================
                DEFINITIONS AND DECLARATIONS FOR MODULE

This section contains definitions for constants, macros, types, variables
and other items needed by this module.
===========================================================================*/

/*                               Macros                                    */
// 0x00 - not present, 0x01 - present & accurate, 0x10 - present but not accurate, 0x11 - Reserved
#define TS_SNTS_GET_FINGER_STATE_0(finger_status_reg) \
		(finger_status_reg&0x03)
#define TS_SNTS_GET_FINGER_STATE_1(finger_status_reg) \
		((finger_status_reg&0x0C)>>2)
#define TS_SNTS_GET_FINGER_STATE_2(finger_status_reg) \
		((finger_status_reg&0x30)>>4)
#define TS_SNTS_GET_FINGER_STATE_3(finger_status_reg) \
      ((finger_status_reg&0xC0)>>6)
#define TS_SNTS_GET_FINGER_STATE_4(finger_status_reg) \
      (finger_status_reg&0x03)

#define TS_SNTS_GET_X_POSITION(high_reg, low_reg) \
		((int)(high_reg*0x10) + (int)(low_reg&0x0F))
#define TS_SNTS_GET_Y_POSITION(high_reg, low_reg) \
		((int)(high_reg*0x10) + (int)((low_reg&0xF0)/0x10))

#define TS_SNTS_HAS_PINCH(gesture_reg) \
		((gesture_reg&0x40)>>6)
#define TS_SNTS_HAS_FLICK(gesture_reg) \
		((gesture_reg&0x10)>>4)
#define TS_SNTS_HAS_DOUBLE_TAP(gesture_reg) \
		((gesture_reg&0x04)>>2)

#define TS_SNTS_GET_REPORT_RATE(device_control_reg) \
		((device_control_reg&0x40)>>6)
// 1st bit : '0' - Allow sleep mode, '1' - Full power without sleeping
// 2nd and 3rd bit : 0x00 - Normal Operation, 0x01 - Sensor Sleep
#define TS_SNTS_GET_SLEEP_MODE(device_control_reg) \
		(device_control_reg&0x07)

#define BLUE_LED_GPIO (OMAP_MAX_GPIO_LINES + TWL4030_GPIO_MAX)

/*                         CONSTANTS DATA DEFINITIONS                      */
#define FINGER_MAX 10 //최대 5개 손가락 사용  

#define TS_DEBUG
#define TS_DEBUG_BUFFER_SIZE		1024

/*
#ifndef TS_USES_IC_GESTURE
#define FLICK_TIME_THRESHOLD		22		// 8
#define FLICK_DISTANCE_THRESHOLD	30		// 15
#endif//TS_USES_IC_GESTURE 
//#define DEFAULT_POLLING_PERIOD		60
//#define HOLD_THRESHOLD				17		// 20		// 15
//#define LONG_THRESHOLD				1000//40   //25		// 10
*/
#define TS_SNTS_X_AXIS_MAX_TM1343_002 1441
#define TS_SNTS_Y_AXIS_MAX_TM1343_002 840
#define FLICK_RANGE 4
#define LONG_PRESS_RANGE 6
#define TAP_TH      10
#define DISTANCE_TH    15
#define SPREADING_TH   20
#define PINCHING_TH    20 

//1497

//------------------------------------------------------------------------------------------------
// Register setting value
//------------------------------------------------------------------------------------------------

  /* Register map header file for TM1343, Family 0x01, Revision 0x01 */
  /* Automatically generated on 2009-Aug-10  10:45:05, do not edit */

#ifndef SYNA_REGISTER_MAP_H
#define SYNA_REGISTER_MAP_H 1

/*      Register Name                                                                    Address     Register Description */
/*      -------------                                                                 -------     -------------------- */

#define SYNA_F01_RMI_QUERY03                               0x00B3   /* Firmware Revision Query */

//#define SYNA_F11_2D_QUERY00                                0x008E   /* Per-device Query */

/* Start of Page Description Table (PDT) */
#define SYNA_PDT_P00_F11_2D_QUERY_BASE                     0x00DD   /* Query Base */
#define SYNA_PDT_P00_F01_RMI_QUERY_BASE                    0x00E3   /* Query Base */
#define SYNA_PDT_P00_F34_FLASH_QUERY_BASE                  0x00E9   /* Query Base */
#define SYNA_P00_PAGESELECT                                0x00FF   /* Page Select register */

/* Offsets within the configuration block */

/*      Register Name                                                                     Offset      Register Description */
/*      -------------                                                                   ------      -------------------- */
#define SYNA_F01_RMI_DEVICE_00_CFGBLK_OFS                  0x0000   /* Device status & Control */
#define SYNA_F01_RMI_INTERRUPT_01_CFGBLK_OFS               0x0001   /* Interrupt status & Enable 0 */
#define SYNA_F11_RMI_CTRL00_CFGBLK_OFS                     0x0000   /* 2D Reprot Mode */

/* Masks for interrupt sources */
#endif  /* SYNA_REGISTER_MAP_H */

#define TS_SNTS_RMI_CTRL00_DEFAULT_VALUE	0x00	// No configured, 80 Hz, Sleep Enable, Normal operation
#define TS_SNTS_RMI_CTRL00_NO_SLEEP			0x48	// No configured, 40 Hz, Sleep Disable, Normal operation
#define TS_SNTS_RMI_CTRL00_RESET_VALUE		0x00	// No configured, 80 Hz, Sleep Enable, Normal operation

#define TS_SNTS_RMI_CTRL01_DEFAULT_VALUE	0x06	// Abs0 Enable, Status Enable, Flash Disable
#define TS_SNTS_RMI_CTRL01_ONLY_ABS0		0x04	// Abs0 Enable, Status Disable, Flash Disable
#define TS_SNTS_RMI_CTRL01_ONLY_FLASH		0x01	// Abs0 Disable, Status Disable, Flash Enable
#define TS_SNTS_RMI_CTRL01_RESET_VALUE		0x07	// Abs0 Enable, Status Enable, Flash Enable

#define TS_SNTS_2D_CTRL00_DEFAULT_VALUE		0x02	// Relative Ballistic Disable, Relative Postion Filter Disable, Absolute Position Filter Disable, Down/Up Reporting Mode
#define TS_SNTS_2D_CTRL00_REDUCED_REPORTING	0x01	// Relative Ballistic Disable, Relative Postion Filter Disable, Absolute Position Filter Disable, Reduced Reporting Mode
#define TS_SNTS_2D_CTRL00_FULL_REPORTING	0x00	// Relative Ballistic Disable, Relative Postion Filter Disable, Absolute Position Filter Disable, Continuous Reporting Mode

//#define TS_SNTS_2D_CTRL10_DEFAULT_VALUE		0x54	// Pinch Enable, Flick Enable, Double Tap Enable
//#define TS_SNTS_2D_CTRL10_RESET_VALUE		0x7F	// All Enable

//#define TS_SNTS_2D_CTRL18_VALUE				0x03	// Minimum Flick Distance (3 * (1 mm))
//#define TS_SNTS_2D_CTRL19_VALUE				0x04	// Minimum Flick Speed (4 * (1 mm / 100 ms))

#define TS_SNTS_2D_CTRL14_VALUE				0x00	// Sensitivity Adjust

///TODO: Must Check this.
//#ifdef TS_I2C_FAIL_MANAGEMENT
#define TS_SNTS_DELAY_BETWEEN_POWER_DOWN_UP 		100	// 100ms	// For T1021
//#endif
#define TS_SNTS_DELAY_TO_LOW_ATTN_FOR_CLEARPAD		500	// 500 ms	// For T1021

//#define TS_SNTS_DEVICE_COMMAND_RESET				1	// Reset
//#define TS_SNTS_FW_VER_RETRY_CNT					10

/*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*/
/*                                                                         */
/*                         DATA DEFINITIONS                                */
/*                                                                         */
/*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*/

typedef struct {
	unsigned char m_QueryBase;
	unsigned char m_CommandBase;
	unsigned char m_ControlBase;
	unsigned char m_DataBase;
	unsigned char m_IntSourceCount;
	unsigned char m_FunctionExists;
} T_RMI4FuncDescriptor;

/* Ku */
typedef int TS_FINGER_STATUS_TYPE;
#define TS_SNTS_NO_PRESENT  0x0
#define TS_SNTS_PRESENT_ACCURATE  0x1


#ifdef TS_VERSION_MANAGEMENT
typedef enum {
	E_TS_RMI4_PAGE_SELECT_00 = 0x00,
} E_TS_RMI_PAGE_SELECT;

typedef enum {
	TS_SNTS_VER_MIN,
	TS_SNTS_VER_MAX
} TS_VERSION_INFO;
#endif /* TS_VERSION_MANAGEMENT */

#ifdef TS_DEBUG
typedef struct {
	int X[FINGER_MAX];
	int Y[FINGER_MAX];
	unsigned char Z[FINGER_MAX];
	unsigned char W[FINGER_MAX];
	//TS_FINGER_STATUS_TYPE finger_status[FINGER_MAX];
	/* Ku */
	//TOUCH_EVENT_TYPE event[FINGER_MAX];
  	// For T1021
  	/*
	unsigned char gesture_flag[2];
	unsigned char pinch_motion_and_X_flick_dist;
	unsigned char Y_flick_dist;
	unsigned char flick_time_reg;
	*/
} touch_event_debugging_data;
#endif /* TS_DEBUG */

//added by jykim
#define START_ADDR      0x13
#define GESTURE_FLAGS	0x4A

#if 0
typedef struct
{
	unsigned char device_status_reg;            //0x13
	unsigned char interrupt_status_reg;			//0x14
	unsigned char finger_state_reg[3];			//0x15~0x17
	// Finger 0
	unsigned char X_high_position_finger0_reg;  //0x18
	unsigned char Y_high_position_finger0_reg;	//0x19
	unsigned char XY_low_position_finger0_reg;	//0x1A
	unsigned char XY_width_finger0_reg;			//0x1B
	unsigned char Z_finger0_reg;				//0x1C
	// Finger 1
	unsigned char X_high_position_finger1_reg;  //0x1D
	unsigned char Y_high_position_finger1_reg;	//0x1E
	unsigned char XY_low_position_finger1_reg;	//0x1F
	unsigned char XY_width_finger1_reg;			//0x20
	unsigned char Z_finger1_reg;				//0x21
 	// Finger 2
	unsigned char X_high_position_finger2_reg;  //0x22
	unsigned char Y_high_position_finger2_reg;	//0x23
	unsigned char XY_low_position_finger2_reg;	//0x24
	unsigned char XY_width_finger2_reg;			//0x25
	unsigned char Z_finger2_reg;				//0x26
#if 0
	// Finger 3
	unsigned char X_high_position_finger3_reg;  //0x27
	unsigned char Y_high_position_finger3_reg;	//0x28
	unsigned char XY_low_position_finger3_reg;	//0x29
	unsigned char XY_width_finger3_reg;			//0x2A
	unsigned char Z_finger3_reg;				//0x2B
 	// Finger 4
	unsigned char X_high_position_finger4_reg;  //0x2C
	unsigned char Y_high_position_finger4_reg;	//0x2D
	unsigned char XY_low_position_finger4_reg;	//0x2E
	unsigned char XY_width_finger4_reg;			//0x2F
	unsigned char Z_finger4_reg;				//0x30
 	// Finger 5
	unsigned char X_high_position_finger5_reg;  //0x31
	unsigned char Y_high_position_finger5_reg;	//0x32
	unsigned char XY_low_position_finger5_reg;	//0x33
	unsigned char XY_width_finger5_reg;			//0x34
	unsigned char Z_finger5_reg;				//0x35
 	// Finger 6
	unsigned char X_high_position_finger6_reg;  //0x36
	unsigned char Y_high_position_finger6_reg;	//0x37
	unsigned char XY_low_position_finger6_reg;	//0x38
	unsigned char XY_width_finger6_reg;			//0x39
	unsigned char Z_finger6_reg;				//0x3A
 	// Finger 7
	unsigned char X_high_position_finger7_reg;  //0x3B
	unsigned char Y_high_position_finger7_reg;	//C
	unsigned char XY_low_position_finger7_reg;	//D
	unsigned char XY_width_finger7_reg;			//E
	unsigned char Z_finger7_reg;				//F
 	// Finger 8
	unsigned char X_high_position_finger8_reg;  //0x40
	unsigned char Y_high_position_finger8_reg;	//
	unsigned char XY_low_position_finger8_reg;	//
	unsigned char XY_width_finger8_reg;			//
	unsigned char Z_finger8_reg;				//0x44
 	// Finger 9
	unsigned char X_high_position_finger9_reg;  //0x45
	unsigned char Y_high_position_finger9_reg;	//
	unsigned char XY_low_position_finger9_reg;	//
	unsigned char XY_width_finger9_reg;			//
	unsigned char Z_finger9_reg;				//0x49

	
	unsigned char gesture_flag0;     	       //0x4A
	unsigned char gesture_flags_1;			   //0x4B
	unsigned char pinch_motion_X_flick_distance;	//04C
	unsigned char rotation_motion_Y_flick_distance;  //0x4D
	unsigned char finger_separation_flick_time;		//0x4E
//	unsigned char button_data;						//0x4F
	unsigned char device_control;			//0x4F
	//unsigned char firmware_ver_reg;
#endif
} ts_sensor_data;
#else	/* JamesLee :: for 4.3 inch touch */
typedef struct
{
	unsigned char device_status_reg;            //0x13
	unsigned char interrupt_status_reg;			//0x14
	unsigned char finger_state_reg;				//0x15
	// Finger 0
	unsigned char X_high_position_finger0_reg;  //0x16
	unsigned char Y_high_position_finger0_reg;	//0x17
	unsigned char XY_low_position_finger0_reg;	//0x18
	unsigned char XY_width_finger0_reg;			//0x19
	unsigned char Z_finger0_reg;				//0x1A
	// Finger 1
	unsigned char X_high_position_finger1_reg;  //0x1B
	unsigned char Y_high_position_finger1_reg;	//0x1C
	unsigned char XY_low_position_finger1_reg;	//0x1D
	unsigned char XY_width_finger1_reg;			//0x1E
	unsigned char Z_finger1_reg;				//0x1F

	unsigned char button_data;					// 0x20
	unsigned char device_control;				// 0x21
	unsigned char interrupt_enable0;			// 0x22
	unsigned char report_mode;					// 0x23
	unsigned char palm_detect;					// 0x24
	unsigned char delta_x_thresh;				// 0x25
	unsigned char delta_y_thresh;				// 0x26
	unsigned char velocity;						// 0x27
	unsigned char acceleration;					// 0x28
	unsigned char max_x_position_7_0;			// 0x29
	unsigned char max_x_position_11_8;			// 0x2A
	unsigned char max_y_position_7_0;			// 0x2B
	unsigned char max_y_position_11_8;			// 0x2C
} ts_sensor_data;
#endif

typedef struct
{
	unsigned char gesture_flag0;     	       //0x4A
	unsigned char gesture_flags_1;			   //0x4B
	unsigned char pinch_motion_X_flick_distance;	//04C
	unsigned char rotation_motion_Y_flick_distance;  //0x4D
	unsigned char finger_separation_flick_time;		//0x4E
	unsigned char device_control;			//0x4F
} ts_gesture_data;


typedef struct {
	unsigned char finger_count;
//  TS_FINGER_STATUS_TYPE finger_status[FINGER_MAX];
	int X_position[FINGER_MAX];
	int Y_position[FINGER_MAX];
//  TOUCH_EVENT_TYPE Event[FINGER_MAX];
} ts_finger_data;

static ts_sensor_data ts_reg_data={0};
static ts_gesture_data ts_gesture_reg = {0};
static ts_finger_data curr_ts_data;

typedef struct {
	//TS_FINGER_STATUS_TYPE finger_status[FINGER_MAX];
	unsigned int action[FINGER_MAX];
  	unsigned int finger_data[FINGER_MAX];
} TOUCH_MULTIFINGER_DATA_TYPE;

/*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*/
/*                                                                         */
/*                            External Data                                */
/*                                                                         */
/*- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*/
/* Ku */
